<template>
    <main id="p2">
        <h1>练习2 万年历问题</h1>
        <el-divider></el-divider>
        <h2>2.1 问题分析</h2><br>
        <p>本问题输入为年月日，输出为输入年月日的下一天，输出格式为xxxx-xx-xx。</p>
        <p> 如果年份越界，输出“Year Exceed”。如果月份越界，输出“Month Exceed”。如果日期越界，输出“Day Exceed”。若三者都越界，则输出“Illegal
            Case”。如果输入的日期不符合月份要求，则输出“day is out of range for month”。 </p>
        <p> 我们规定 ≤ Month ≤ 12，1 ≤ Day ≤ 31，对于年份的范围，规定2000 ≤ Year ≤ 2100。</p>
        <el-divider></el-divider>
        <h2>2.2 边界值分析-测试用例</h2><br>
        <el-table :data="td1">
            <el-table-column prop="序号" label="序号" width="100"></el-table-column>
            <el-table-column prop="年" label="年" width="120"></el-table-column>
            <el-table-column prop="月" label="月" width="120"></el-table-column>
            <el-table-column prop="日" label="日" width="120"></el-table-column>
            <el-table-column prop="预期输出" label="预期输出" width="210"></el-table-column>
            <el-table-column prop="实际输出" label="实际输出" width="210"></el-table-column>
            <el-table-column prop="测试结果" label="测试结果" width="100"></el-table-column>
        </el-table>
        <el-divider></el-divider>
        <h2>2.3 等价类分析-测试用例</h2><br>
        <p>可对于年月日分别划分等价类：</p>
        <ul>
            <li>年</li>
            <ul>
                <li>有效等价类</li>
                <ul>
                    <li>2000-2100年中的平年</li>
                    <li>2000-2100年中的闰年</li>
                </ul>
            </ul>
            <ul>
                <li>无效等价类</li>
                <ul>
                    <li>小于2000</li>
                    <li>大于2100</li>
                </ul>
            </ul>
        </ul>
        <ul>
            <li>月</li>
            <ul>
                <li>有效等价类</li>
                <ul>
                    <li>不包括12月的含31天的月份 {1、3、5、7、8、10}</li>
                    <li>含30天的月份 {4，6，9，11} </li>
                    <li>2月</li>
                    <li>12月</li>
                </ul>
            </ul>
            <ul>
                <li>无效等价类</li>
                <ul>
                    <li>小于1</li>
                    <li>大于12</li>
                </ul>
            </ul>
        </ul>
        <ul>
            <li>日</li>
            <ul>
                <li>有效等价类</li>
                <ul>
                    <li>1-27</li>
                    <li>28</li>
                    <li>29</li>
                    <li>30</li>
                    <li>31</li>
                </ul>
            </ul>
            <ul>
                <li>无效等价类</li>
                <ul>
                    <li>大于31</li>
                    <li>小于1</li>
                </ul>
            </ul>
        </ul><br>
        <p>本问题基于多缺陷假设，采用强一般等价类的划分，构成测试用例如下表所示：</p><br>
        <el-table :data="td2">
            <el-table-column prop="序号" label="序号" width="100"></el-table-column>
            <el-table-column prop="年" label="年" width="120"></el-table-column>
            <el-table-column prop="月" label="月" width="120"></el-table-column>
            <el-table-column prop="日" label="日" width="120"></el-table-column>
            <el-table-column prop="预期输出" label="预期输出" width="210"></el-table-column>
            <el-table-column prop="实际输出" label="实际输出" width="210"></el-table-column>
            <el-table-column prop="测试结果" label="测试结果" width="100"></el-table-column>
        </el-table>
        <el-divider></el-divider>
        <h2>2.4 决策表分析-测试用例</h2><br>
        <p>根据2.3的等价类分析，有条件条目：</p><br>
        <table>
            <tr>
                <td>Y1</td>
                <td>{year是闰年}</td>
                <td>Y2</td>
                <td>{year不是闰年}</td>
            </tr>
            <tr>
                <td>M1</td>
                <td>{month=4,6,9,11} </td>
                <td> M2</td>
                <td>{month=1,3,5,7,8,10}</td>
            </tr>
            <tr>
                <td>M3</td>
                <td>{month=12} </td>
                <td> M4</td>
                <td>{month=2}</td>
            </tr>
            <tr>
                <td>D1</td>
                <td>{1≤day≤27}</td>
                <td>D2</td>
                <td>{day=28}</td>
            </tr>
            <tr>
                <td>D3</td>
                <td>{day=29}</td>
                <td>D4</td>
                <td>{day=30}</td>
                <td>D5</td>
                <td>{day=31}</td>
            </tr>
        </table><br>
        <p>结合以上等价类划分的情况给出问题规定的可能采取的操作，即列出所有的动作桩：
        </p>
        <p>A1: day+1；A2: day=1；A3: month+1；A4: month=1；A5: year+1；A6：不可能</p>
        <p>从而有以下的决策表：</p><br>
        <el-table :data="td3">
            <el-table-column prop="桩/规则" label="桩/规则" width="80"></el-table-column>
            <el-table-column prop="1" label="1" width="92"></el-table-column>
            <el-table-column prop="2" label="2" width="92"></el-table-column>
            <el-table-column prop="3" label="3" width="92"></el-table-column>
            <el-table-column prop="4" label="4" width="92"></el-table-column>
            <el-table-column prop="5" label="5" width="92"></el-table-column>
            <el-table-column prop="6" label="6" width="92"></el-table-column>
            <el-table-column prop="7" label="7" width="92"></el-table-column>
            <el-table-column prop="8" label="8" width="92"></el-table-column>
            <el-table-column prop="9" label="9" width="92"></el-table-column>
            <el-table-column prop="10" label="10" width="92"></el-table-column>
            <el-table-column prop="11" label="11" width="92"></el-table-column>
        </el-table><br>
        <p>对上面的决策表进行化简，设计测试用例共11个：</p><br>
        <el-table :data="td4">
            <el-table-column prop="序号" label="序号" width="100"></el-table-column>
            <el-table-column prop="年" label="年" width="120"></el-table-column>
            <el-table-column prop="月" label="月" width="120"></el-table-column>
            <el-table-column prop="日" label="日" width="120"></el-table-column>
            <el-table-column prop="预期输出" label="预期输出" width="210"></el-table-column>
            <el-table-column prop="实际输出" label="实际输出" width="210"></el-table-column>
            <el-table-column prop="测试结果" label="测试结果" width="100"></el-table-column>
        </el-table>
    </main>
</template>
<script setup>
import { ref } from 'vue';
const td1 = ref([
    { '序号': 1, '年': 1999, '月': 6, '日': 15, '预期输出': 'Year Exceed', '实际输出': 'Year Exceed', '测试结果': '通过' },
    { '序号': 2, '年': 2000, '月': 6, '日': 15, '预期输出': '2000-06-16', '实际输出': '2000-06-16', '测试结果': '通过' },
    { '序号': 3, '年': 2001, '月': 6, '日': 15, '预期输出': '2001-06-16', '实际输出': '2001-06-16', '测试结果': '通过' },
    { '序号': 4, '年': 2050, '月': 6, '日': 15, '预期输出': '2050-06-16', '实际输出': '2050-06-16', '测试结果': '通过' },
    { '序号': 5, '年': 2099, '月': 6, '日': 15, '预期输出': '2099-06-16', '实际输出': '2099-06-16', '测试结果': '通过' },
    { '序号': 6, '年': 2100, '月': 6, '日': 15, '预期输出': '2100-06-16', '实际输出': '2100-06-16', '测试结果': '通过' },
    { '序号': 7, '年': 2101, '月': 6, '日': 15, '预期输出': 'Year Exceed', '实际输出': 'Year Exceed', '测试结果': '通过' },
    { '序号': 8, '年': 2050, '月': 0, '日': 15, '预期输出': 'Month Exceed', '实际输出': 'Month Exceed', '测试结果': '通过' },
    { '序号': 9, '年': 2050, '月': 1, '日': 15, '预期输出': '2050-01-16', '实际输出': '2050-01-16', '测试结果': '通过' },
    { '序号': 10, '年': 2050, '月': 2, '日': 15, '预期输出': '2050-02-16', '实际输出': '2050-02-16', '测试结果': '通过' },
    { '序号': 11, '年': 2050, '月': 11, '日': 15, '预期输出': '2050-11-16', '实际输出': '2050-11-16', '测试结果': '通过' },
    { '序号': 12, '年': 2050, '月': 12, '日': 15, '预期输出': '2050-12-16', '实际输出': '2050-12-16', '测试结果': '通过' },
    { '序号': 13, '年': 2050, '月': 13, '日': 15, '预期输出': 'Month Exceed', '实际输出': 'Month Exceed', '测试结果': '通过' },
    { '序号': 14, '年': 2050, '月': 6, '日': 0, '预期输出': 'Day Exceed', '实际输出': 'Day Exceed', '测试结果': '通过' },
    { '序号': 15, '年': 2050, '月': 6, '日': 1, '预期输出': '2050-06-02', '实际输出': '2050-06-02', '测试结果': '通过' },
    { '序号': 16, '年': 2050, '月': 6, '日': 2, '预期输出': '2050-06-03', '实际输出': '2050-06-03', '测试结果': '通过' },
    { '序号': 17, '年': 2050, '月': 6, '日': 30, '预期输出': '2050-07-01', '实际输出': '2050-07-01', '测试结果': '通过' },
    { '序号': 18, '年': 2050, '月': 6, '日': 31, '预期输出': 'day is out of range for month', '实际输出': 'day is out of range for month', '测试结果': '通过' },
    { '序号': 19, '年': 2050, '月': 6, '日': 32, '预期输出': 'Day Exceed', '实际输出': 'Day Exceed', '测试结果': '通过' }
]);
const td2 = ref([
    { 序号: 1, 年: 2008, 月: 1, 日: 1, 预期输出: "2008-01-02", 实际输出: "2008-01-02", 测试结果: "通过" },
    { 序号: 2, 年: 2008, 月: 1, 日: 28, 预期输出: "2008-01-29", 实际输出: "2008-01-29", 测试结果: "通过" },
    { 序号: 3, 年: 2008, 月: 1, 日: 29, 预期输出: "2008-01-30", 实际输出: "2008-01-30", 测试结果: "通过" },
    { 序号: 4, 年: 2008, 月: 1, 日: 30, 预期输出: "2008-01-31", 实际输出: "2008-01-31", 测试结果: "通过" },
    { 序号: 5, 年: 2008, 月: 1, 日: 31, 预期输出: "2008-02-01", 实际输出: "2008-02-01", 测试结果: "通过" },
    { 序号: 6, 年: 2008, 月: 4, 日: 1, 预期输出: "2008-04-02", 实际输出: "2008-04-02", 测试结果: "通过" },
    { 序号: 7, 年: 2008, 月: 4, 日: 28, 预期输出: "2008-04-29", 实际输出: "2008-04-29", 测试结果: "通过" },
    { 序号: 8, 年: 2008, 月: 4, 日: 29, 预期输出: "2008-04-30", 实际输出: "2008-04-30", 测试结果: "通过" },
    { 序号: 9, 年: 2008, 月: 4, 日: 30, 预期输出: "2008-05-01", 实际输出: "2008-05-01", 测试结果: "通过" },
    { 序号: 10, 年: 2008, 月: 4, 日: 31, 预期输出: "day is out of range for month", 实际输出: "day is out of range for month", 测试结果: "通过" },
    { 序号: 11, 年: 2008, 月: 2, 日: 1, 预期输出: "2008-02-02", 实际输出: "2008-02-02", 测试结果: "通过" },
    { 序号: 12, 年: 2008, 月: 2, 日: 28, 预期输出: "2008-02-29", 实际输出: "2008-02-29", 测试结果: "通过" },
    { 序号: 13, 年: 2008, 月: 2, 日: 29, 预期输出: "2008-03-01", 实际输出: "2008-03-01", 测试结果: "通过" },
    { 序号: 14, 年: 2008, 月: 2, 日: 30, 预期输出: "day is out of range for month", 实际输出: "day is out of range for month", 测试结果: "通过" },
    { 序号: 15, 年: 2008, 月: 2, 日: 31, 预期输出: "day is out of range for month", 实际输出: "day is out of range for month", 测试结果: "通过" },
    { 序号: 16, 年: 2008, 月: 12, 日: 1, 预期输出: "2008-12-02", 实际输出: "2008-12-02", 测试结果: "通过" },
    { 序号: 17, 年: 2008, 月: 12, 日: 28, 预期输出: "2008-12-29", 实际输出: "2008-12-29", 测试结果: "通过" },
    { 序号: 18, 年: 2008, 月: 12, 日: 29, 预期输出: "2008-12-30", 实际输出: "2008-12-30", 测试结果: "通过" },
    { 序号: 19, 年: 2008, 月: 12, 日: 30, 预期输出: "2008-12-31", 实际输出: "2008-12-31", 测试结果: "通过" },
    { 序号: 20, 年: 2008, 月: 12, 日: 31, 预期输出: "2008-01-01", 实际输出: "2008-01-01", 测试结果: "通过" },
    { 序号: 21, 年: 2009, 月: 1, 日: 1, 预期输出: "2009-01-02", 实际输出: "2009-01-02", 测试结果: "通过" },
    { 序号: 22, 年: 2009, 月: 1, 日: 28, 预期输出: "2009-01-29", 实际输出: "2009-01-29", 测试结果: "通过" },
    { 序号: 23, 年: 2009, 月: 1, 日: 29, 预期输出: "2009-01-30", 实际输出: "2009-01-30", 测试结果: "通过" },
    { 序号: 24, 年: 2009, 月: 1, 日: 30, 预期输出: "2009-01-31", 实际输出: "2009-01-31", 测试结果: "通过" },
    { 序号: 25, 年: 2009, 月: 1, 日: 31, 预期输出: "2009-02-01", 实际输出: "2009-02-01", 测试结果: "通过" },
    { 序号: 26, 年: 2009, 月: 4, 日: 1, 预期输出: "2009-04-02", 实际输出: "2009-04-02", 测试结果: "通过" },
    { 序号: 27, 年: 2009, 月: 4, 日: 28, 预期输出: "2009-04-29", 实际输出: "2009-04-29", 测试结果: "通过" },
    { 序号: 28, 年: 2009, 月: 4, 日: 29, 预期输出: "2009-04-30", 实际输出: "2009-04-30", 测试结果: "通过" },
    { 序号: 29, 年: 2009, 月: 4, 日: 30, 预期输出: "2009-05-01", 实际输出: "2009-05-01", 测试结果: "通过" },
    { 序号: 30, 年: 2009, 月: 4, 日: 31, 预期输出: "day is out of range for month", 实际输出: "day is out of range for month", 测试结果: "通过" },
    { 序号: 31, 年: 2009, 月: 2, 日: 1, 预期输出: "2009-02-02", 实际输出: "2008-02-02", 测试结果: "通过" },
    { 序号: 32, 年: 2009, 月: 2, 日: 28, 预期输出: "2009-03-01", 实际输出: "2008-03-01", 测试结果: "通过" },
    { 序号: 33, 年: 2009, 月: 2, 日: 29, 预期输出: "day is out of range for month", 实际输出: "day is out of range for month", 测试结果: "通过" },
    { 序号: 34, 年: 2009, 月: 2, 日: 30, 预期输出: "day is out of range for month", 实际输出: "day is out of range for month", 测试结果: "通过" },
    { 序号: 35, 年: 2009, 月: 2, 日: 31, 预期输出: "day is out of range for month", 实际输出: "day is out of range for month", 测试结果: "通过" },
    { 序号: 36, 年: 2009, 月: 12, 日: 1, 预期输出: "2009-12-02", 实际输出: "2009-12-02", 测试结果: "通过" },
    { 序号: 37, 年: 2009, 月: 12, 日: 28, 预期输出: "2009-12-29", 实际输出: "2009-12-29", 测试结果: "通过" },
    { 序号: 38, 年: 2009, 月: 12, 日: 29, 预期输出: "2009-12-30", 实际输出: "2009-12-30", 测试结果: "通过" },
    { 序号: 39, 年: 2009, 月: 12, 日: 30, 预期输出: "2009-12-31", 实际输出: "2009-12-31", 测试结果: "通过" },
    { 序号: 40, 年: 2009, 月: 12, 日: 31, 预期输出: "2010-01-01", 实际输出: "2010-01-01", 测试结果: "通过" },
]);
const td3 = ref([
    {
        '桩/规则': '年',
        1: 'Y1/Y2',
        2: 'Y1/Y2',
        3: 'Y1/Y2',
        4: 'Y1/Y2',
        5: 'Y1/Y2',
        6: 'Y1/Y2',
        7: 'Y1/Y2',
        8: 'Y1/Y2',
        9: 'Y1',
        10: 'Y2',
        11: 'Y1/Y2'
    },
    {
        '桩/规则': '月',
        1: 'M1',
        2: 'M1',
        3: 'M1',
        4: 'M2',
        5: 'M2',
        6: 'M3',
        7: 'M3',
        8: 'M4',
        9: 'M4',
        10: 'M4',
        11: 'M4'
    },
    {
        '桩/规则': '日',
        1: 'D1/D2/D3',
        2: 'D4',
        3: 'D5',
        4: 'D1/D2/D3/D4',
        5: 'D5',
        6: 'D1/D2/D3/D4',
        7: 'D5',
        8: 'D1/D2',
        9: 'D3',
        10: 'D3',
        11: 'D4/D5/D6'
    },
    {
        '桩/规则': 'A1',
        1: 'X',
        2: '',
        3: '',
        4: 'X',
        5: '',
        6: 'X',
        7: '',
        8: 'X',
        9: '',
        10: '',
        11: ''
    },
    {
        '桩/规则': 'A2',
        1: '',
        2: 'X',
        3: '',
        4: '',
        5: 'X',
        6: '',
        7: 'X',
        8: '',
        9: 'X',
        10: '',
        11: ''
    },
    {
        '桩/规则': 'A3',
        1: '',
        2: 'X',
        3: '',
        4: '',
        5: 'X',
        6: '',
        7: '',
        8: '',
        9: 'X',
        10: '',
        11: ''
    },
    {
        '桩/规则': 'A4',
        1: '',
        2: '',
        3: '',
        4: '',
        5: '',
        6: '',
        7: 'X',
        8: '',
        9: '',
        10: '',
        11: ''
    },
    {
        '桩/规则': 'A5',
        1: '',
        2: '',
        3: '',
        4: '',
        5: '',
        6: '',
        7: 'X',
        8: '',
        9: '',
        10: '',
        11: ''
    },
    {
        '桩/规则': 'A6',
        1: '',
        2: '',
        3: 'X',
        4: '',
        5: '',
        6: '',
        7: '',
        8: '',
        9: '',
        10: 'X',
        11: 'X'
    }
]);
const td4 = ref([
    {
        序号: 1,
        年: 2008,
        月: 4,
        日: 24,
        预期输出: '2008-04-25',
        实际输出: '2008-04-25',
        测试结果: '通过'
    },
    {
        序号: 2,
        年: 2008,
        月: 4,
        日: 30,
        预期输出: '2008-05-01',
        实际输出: '2008-05-01',
        测试结果: '通过'
    },
    {
        序号: 3,
        年: 2008,
        月: 4,
        日: 31,
        预期输出: 'day is out of range for month',
        实际输出: 'day is out of range for month',
        测试结果: '通过'
    },
    {
        序号: 4,
        年: 2008,
        月: 1,
        日: 24,
        预期输出: '2008-01-25',
        实际输出: '2008-01-25',
        测试结果: '通过'
    },
    {
        序号: 5,
        年: 2008,
        月: 1,
        日: 31,
        预期输出: '2008-02-01',
        实际输出: '2008-02-01',
        测试结果: '通过'
    },
    {
        序号: 6,
        年: 2009,
        月: 12,
        日: 24,
        预期输出: '2008-12-25',
        实际输出: '2008-12-25',
        测试结果: '通过'
    },
    {
        序号: 7,
        年: 2009,
        月: 12,
        日: 31,
        预期输出: '2010-01-01',
        实际输出: '2010-01-01',
        测试结果: '通过'
    },
    {
        序号: 8,
        年: 2008,
        月: 2,
        日: 24,
        预期输出: '2008-02-25',
        实际输出: '2008-02-25',
        测试结果: '通过'
    },
    {
        序号: 9,
        年: 2008,
        月: 2,
        日: 28,
        预期输出: '2008-02-29',
        实际输出: '2008-02-29',
        测试结果: '通过'
    },
    {
        序号: 10,
        年: 2009,
        月: 2,
        日: 28,
        预期输出: 'day is out of range for month',
        实际输出: 'day is out of range for month',
        测试结果: '通过'
    },
    {
        序号: 11,
        年: 2009,
        月: 2,
        日: 30,
        预期输出: 'day is out of range for month',
        实际输出: 'day is out of range for month',
        测试结果: '通过'
    }
])
</script>
<style lang="scss" scoped>
#p2 {
    margin: 20px;
}

ul ul {
    margin-left: 20px;
}

ul ul ul {
    margin-left: 40px;
}
</style>