<template>
    <main id="p3">
        <h1>练习3 电脑销售系统</h1>
        <el-divider></el-divider>
        <h2>3.1 题目描述</h2><br>
        <p>主机（25￥单位价格，每月最多销售的数量为70），显示器（30￥单位价格，每月最多销售数量为80），外设（45￥单位价格，每月最多销售的数量为90）；每个销售员每月至少销售一台完整的机器，当系统的主机这个变量接受到-1值的时候，系统自动统计该销售员本月的销售总额。当销售额小于等于1000（包括1000）按照10%提佣金，当销售额在1000-1800之间（包括1800）的时候按照15%提佣金，当销售额大于1800时按照20%提佣金。（用边界值方法分析和设计测试用例）
        </p>
        <el-divider></el-divider>
        <h2>3.2 测试计划</h2><br>
        <p>本题使用边界值分析法设计测试用例，如果使用输入变量设计测试用例，则大部分的销售额都会大于1800，无法覆盖输出变量中的各种情况。因此使用输出变量，采用基本的边界值分析法设计测试用例。
        </p>
        <p>销售额取值范围：
        </p>
        <ul>
            <li>100 - 1000</li>
            <li>1000 - 1800 </li>
            <li>1800 - 8200 </li>
        </ul>
        <p>将其反推到输入变量进行，取整数，并补充必要用例。</p><br>
        <el-table :data="td1">
            <el-table-column prop="主机" label="主机" width="150"></el-table-column>
            <el-table-column prop="显示器" label="显示器" width="150"></el-table-column>
            <el-table-column prop="IO设备" label="IO设备" width="150"></el-table-column>
            <el-table-column prop="销售额" label="销售额" width="150"></el-table-column>
            <el-table-column prop="预期佣金" label="预期佣金" width="150"></el-table-column>
            <el-table-column prop="测试结果" label="测试结果" width="200"></el-table-column>
        </el-table><br>
        <img :src="l3URL" alt="L3" />
    </main>
</template>
<script setup>
import { ref } from 'vue';
import l3URL from '../assets/l3.png'
const td1 = ref([
    {
        主机: 1,
        显示器: 1,
        IO设备: 1,
        销售额: 100,
        预期佣金: 10,
        测试结果: '通过'
    },
    {
        主机: 2,
        显示器: 1,
        IO设备: 1,
        销售额: 125,
        预期佣金: 12.5,
        测试结果: '通过'
    },
    {
        主机: 5,
        显示器: 5,
        IO设备: 5,
        销售额: 500,
        预期佣金: 50,
        测试结果: '通过'
    },
    {
        主机: 9,
        显示器: 10,
        IO设备: 10,
        销售额: 975,
        预期佣金: 97.5,
        测试结果: '通过'
    },
    {
        主机: 10,
        显示器: 10,
        IO设备: 10,
        销售额: 1000,
        预期佣金: 100,
        测试结果: '通过'
    },
    {
        主机: 10,
        显示器: 10,
        IO设备: 11,
        销售额: 1045,
        预期佣金: 156.75,
        测试结果: '通过'
    },
    {
        主机: 14,
        显示器: 14,
        IO设备: 14,
        销售额: 1400,
        预期佣金: 210,
        测试结果: '通过'
    },
    {
        主机: 17,
        显示器: 17,
        IO设备: 18,
        销售额: 1750,
        预期佣金: 261.75,
        测试结果: '通过'
    },
    {
        主机: 18,
        显示器: 18,
        IO设备: 18,
        销售额: 1800,
        预期佣金: 270,
        测试结果: '通过'
    },
    {
        主机: 18,
        显示器: 18,
        IO设备: 19,
        销售额: 1845,
        预期佣金: 369,
        测试结果: '通过'
    },
    {
        主机: 50,
        显示器: 50,
        IO设备: 50,
        销售额: 5000,
        预期佣金: 1000,
        测试结果: '通过'
    },
    {
        主机: 68,
        显示器: 80,
        IO设备: 90,
        销售额: 8150,
        预期佣金: 1630,
        测试结果: '通过'
    },
    {
        主机: 70,
        显示器: 80,
        IO设备: 90,
        销售额: 8200,
        预期佣金: 1640,
        测试结果: '通过'
    },
    {
        主机: 0,
        显示器: 0,
        IO设备: 0,
        销售额: 0,
        预期佣金: '未完成最小额',
        测试结果: '通过'
    },
    {
        主机: -1,
        显示器: 0,
        IO设备: 0,
        销售额: 0,
        预期佣金: '退出系统',
        测试结果: '通过'
    },
    {
        主机: -5,
        显示器: -5,
        IO设备: -5,
        销售额: -500,
        预期佣金: '销售量为正数',
        测试结果: '通过'
    }
])
</script>
<style lang="scss" scoped>
#p3 {
    margin: 20px;
}
</style>